# 写一个登陆程序, 接受用户的 用户名和密码。
# 判断用户名和密码, 是否正确。  正确则显示欢迎登陆， 否则告知用户名或密码错误。
name = "miller"
pwd = "123"

'''Python变量名相当于门牌号，指向值所在的内存地址，那么a = 1,b = a,修改a = 3,b指向的值是_______'''

'''假设变量a为10，变量b为20，那么计算b<=a的执行结果是____'''

'''假设变量a为10，变量b为20，b+=a 那么b输出结果是____'''
'''假设变量a为10，变量b为20，b%=a 那么b输出结果是____'''
'''假设变量a为10，变量b为20，b/=a 那么b输出结果是____'''
'''假设变量a为10，变量b为20，b//=a 那么b输出结果是____'''
'''假设变量a为10，变量b为20，b*=a 那么b输出结果是____'''

# age_of_girl = 18
# height = 171
# weight = 99
# is_pretty = True
#
# if age_of_girl >= 18 and age_of_girl < 22 and height > 170 and weight < 100 and is_pretty == True:
#     print('表白...')
# else:
#     print('阿姨好')


